golf_scorecard_api/app/controllers/golfers_controller.rb

SELECT "golfers".* FROM "golfers"
---
  def index
    @golfers = Golfer.all

INSERT INTO "golfers" ("course", "player", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["course", "asdfasdf"], ["player", "asdf"], ["created_at", "2018-01-26 11:28:01.419559"], ["updated_at", "2018-01-26 11:28:01.419559"]]
---
  def create
    @golfer = Golfer.new(golfer_params)

    if @golfer.save

UPDATE "golfers" SET "course" = $1, "player" = $2, "updated_at" = $3 WHERE "golfers"."id" = $4  [["course", "ads"], ["player", "adf"], ["updated_at", "2018-01-26 11:25:34.243617"], ["id", 1]]
---
  def update
    if @golfer.update(golfer_params)

DELETE FROM "golfers" WHERE "golfers"."id" = $1  [["id", 3]]
---
  def destroy
    @golfer.destroy

SELECT  "golfers".* FROM "golfers" WHERE "golfers"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_golfer
      @golfer = Golfer.find(params[:id])