golf_scorecard_api/app/controllers/scorecards_controller.rb

SELECT "scorecards".* FROM "scorecards"
---
  def index
    @scorecards = Scorecard.all

INSERT INTO "scorecards" ("holenumber", "par", "score", "created_at", "updated_at", "golfer_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["holenumber", 20], ["par", 5], ["score", 8], ["created_at", "2018-01-26 05:41:28.163091"], ["updated_at", "2018-01-26 05:41:28.163091"], ["golfer_id", 2]]
---
  def create
    @scorecard = Scorecard.new(scorecard_params)
    @scorecard.golfer_id = params[:golfer_id]

    if @scorecard.save

UPDATE "scorecards" SET "par" = $1, "score" = $2, "holenumber" = $3, "updated_at" = $4 WHERE "scorecards"."id" = $5  [["par", 1], ["score", 1], ["holenumber", 77], ["updated_at", "2018-01-26 10:45:54.838438"], ["id", 52]]
---
  def update
    if @scorecard.update(scorecard_params)

DELETE FROM "scorecards" WHERE "scorecards"."id" = $1  [["id", 37]]
---
  def destroy
    @scorecard.destroy

SELECT  "scorecards".* FROM "scorecards" WHERE "scorecards"."id" = $1 LIMIT $2  [["id", 37], ["LIMIT", 1]]
---
    def set_scorecard
      @scorecard = Scorecard.find(params[:id])